# Function

# index Function

In [29]:
import pandas as pd

var2 = pd.read_csv("C:\\Users\\USER\\Documents\\Pandas in Python\\CSV FILE1")

(var2.index)   # Here it it shows the iteration of index describes the start and stop and step of indexing

RangeIndex(start=0, stop=4, step=1)

# column Function

In [17]:
var3 = pd.read_csv("C:\\Users\\USER\\Documents\\Pandas in Python\\CSV FILE1")

# Here it shows the "column" names used OR assigned

var3.columns

Index(['Name', 'Age', 'Weight'], dtype='object')

# describe() Function

In [21]:
var4 = pd.read_csv("C:\\Users\\USER\\Documents\\Pandas in Python\\CSV FILE1")

# Here it divides and showcases  the data into min max and percentages   

var4.describe()

             Age     Weight
count   4.000000   4.000000
mean   21.250000  58.000000
std     1.258306   6.055301
min    20.000000  54.000000
25%    20.750000  54.750000
50%    21.000000  55.500000
75%    21.500000  58.750000
max    23.000000  67.000000

# head() Function

In [33]:
var5 = pd.read_csv("C:\\Users\\USER\\Documents\\Pandas in Python\\CSV FILE1")
print(var5.head())

# Here it displayes the first five element of data - By default
# AND if we pass a parameter then that number of data is showed

print()

print(var5.head(2))

       Name  Age  Weight
0  Siddhant   20      55
1   Santosh   21      56
2        Om   21      54
3       Sai   23      67

       Name  Age  Weight
0  Siddhant   20      55
1   Santosh   21      56

# tail Function

In [41]:
# It showcase the data from downside of file data and Behave same it terms of head

var6 = pd.read_csv("C:\\Users\\USER\\Documents\\Pandas in Python\\CSV FILE1")
var6.tail(1) 

# Here it showcases the data 1 from downside of file data bydefault 5 elements

       Name  Age  Weight
0  Siddhant   20      55

# Range Indexing

In [43]:
var6[1:3]
# Here the data from the 1 to "2" is displayed (1:3-1)

      Name  Age  Weight
1  Santosh   21      56
2       Om   21      54

# index to ARRAY conversion

In [45]:
var6.index.array
# Here we converted the index of CSV file variable into "ARRAY"

<PandasArray>
[0, 1, 2, 3]
Length: 4, dtype: int64

# CSV to NUMPUY Conversion

In [50]:
var6.to_numpy

# Here we converted the dataframe of csv file to and "NUMPY" Data

<bound method DataFrame.to_numpy of        Name  Age  Weight
0  Siddhant   20      55
1   Santosh   21      56
2        Om   21      54
3       Sai   23      67>

# sort_index() function

In [53]:
var6.sort_index(axis = 0,ascending = False)

# Here we sorted the data into decending order using sort function

       Name  Age  Weight
3       Sai   23      67
2        Om   21      54
1   Santosh   21      56
0  Siddhant   20      55

# loc() function

In [57]:
var6.loc[0,"Name"] = "Vishnu"  # Initially the name was "siddhant" we changed it into "vishnu" using loc()function
var6

      Name  Age  Weight
0   Vishnu   20      55
1  Santosh   21      56
2       Om   21      54
3      Sai   23      67

In [60]:
# loc() function can also be used for acessing the data element from the data

var6.loc[[0,1],["Name","Age"]]

# Here we acessed the data member from 0 to 1 of "Name" and "Age" using loc

      Name  Age
0   Vishnu   20
1  Santosh   21

# iloc Function

In [67]:
var6.iloc[0,0]  
var6.iloc[1,1]
# Here it access the element index wise 
# accessed the data from 0th column and 0th row

21

# drop Function

In [75]:
# This function is used  to delete the column and row from the data

var6.drop(["Name"],axis = 1)

   Age  Weight
0   20      55
1   21      56
2   21      54
3   23      67